uhnp/src/InformationRegisters/ИерархияРасширеннойАдресации/ИерархияРасширеннойАдресации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИерархияРасширеннойАдресации</name>
  <attributes>
    <name>СправочникИБ</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлементАдресации</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодительЭлемента</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ИерархияРасширеннойАдресации/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Шаблон = 
	"		КОГДА РегистрСведенийИерархияРасширеннойАдресации.ЭлементАдресации = ЗНАЧЕНИЕ(Справочник.%1.ПустаяСсылка)
	|			ТОГДА ""%2""";
	Шаблон2 = 
	"		КОГДА РегистрСведенийИерархияРасширеннойАдресации.РодительЭлемента = ЗНАЧЕНИЕ(Справочник.%1.ПустаяСсылка)
	|			ТОГДА ""%2""";
	
	Вставка = "ВЫБОР";
	Вставка2 = "ВЫБОР";
	
	ЗапросПоТипам = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                             |	ТИПЗНАЧЕНИЯ(ИерархияРасширеннойАдресации.ЭлементАдресации) КАК ТипСправочника
	                             |ИЗ
	                             |	РегистрСведений.ИерархияРасширеннойАдресации КАК ИерархияРасширеннойАдресации
	                             |
	                             |ОБЪЕДИНИТЬ
	                             |
	                             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                             |	ТИПЗНАЧЕНИЯ(ИерархияРасширеннойАдресации.РодительЭлемента)
	                             |ИЗ
	                             |	РегистрСведений.ИерархияРасширеннойАдресации КАК ИерархияРасширеннойАдресации");
	
	ВыборкаПоТипам = ЗапросПоТипам.Выполнить().Выбрать();
	МассивОбъектовМетаданных = Новый Массив;
		
	Пока ВыборкаПоТипам.Следующий() Цикл
		ТипМетаданныхСправочника = Метаданные.НайтиПоТипу(ВыборкаПоТипам.ТипСправочника);
		
		Если ТипМетаданныхСправочника = Неопределено Тогда
			Продолжить;
		КонецЕсли;
				
		МассивОбъектовМетаданных.Добавить(ТипМетаданныхСправочника);		
	КонецЦикла;
	
	Для Каждого Справочник Из МассивОбъектовМетаданных Цикл	
		ИмяСправочника = СтрЗаменить(Справочник.ПолноеИмя(), "Справочник.", "");
		ПредставлениеСправочника = СтрЗаменить(Строка(Справочник), """", """""");
		Если ИмяСправочника = "" тогда
			Продолжить;
		КонецЕсли;
				
		Вставка = Вставка + Символы.ПС + СтрШаблон(Шаблон, ИмяСправочника, СтрШаблон(НСтр("ru = '<%1: все элементы>'"), ПредставлениеСправочника));
		Вставка2 = Вставка2 + Символы.ПС + СтрШаблон(Шаблон2, ИмяСправочника, "<" + ПредставлениеСправочника + ">");
	КонецЦикла;
	
	СтрокаНеопределено = НСтр("ru = '<Не определено>'");
	
	Вставка = Вставка + "
	|		КОГДА РегистрСведенийИерархияРасширеннойАдресации.ЭлементАдресации = НЕОПРЕДЕЛЕНО
	|			ТОГДА """ + СтрокаНеопределено + """
	|		ИНАЧЕ РегистрСведенийИерархияРасширеннойАдресации.ЭлементАдресации
	|	КОНЕЦ";
	Вставка2 = Вставка2 + "
	|		КОГДА РегистрСведенийИерархияРасширеннойАдресации.РодительЭлемента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """ + СтрокаНеопределено + """
	|		ИНАЧЕ РегистрСведенийИерархияРасширеннойАдресации.РодительЭлемента
	|	КОНЕЦ";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""Вставка"" КАК ЭлементАдресации,
	|	""Вставка2"" КАК РодительЭлемента,
	|	РегистрСведенийИерархияРасширеннойАдресации.СправочникИБ КАК СправочникИБ
	|ИЗ
	|	РегистрСведений.ИерархияРасширеннойАдресации КАК РегистрСведенийИерархияРасширеннойАдресации";
	
	Список.ТекстЗапроса = СтрЗаменить(СтрЗаменить(ТекстЗапроса, """Вставка""", Вставка), """Вставка2""", Вставка2);
	
КонецПроцедуры
